;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; notification on org
(package! org-alert)

;; customize theme
(package! catppuccin-theme)

;; cursor
(package! beacon)

;; better pomodoro
(package! pomidor)

;; typst
;; (package! typst-ts-mode :recipe (:type git :host sourcehut :repo "meow_king/typst-ts-mode"))

;;python autoload env
(package! pyvenv)

;;rss for research paper
(package! elfeed-score)

;;translate
;; (package! google-translate)

;; cross-platform embedded
(package! platformio-mode)

;; vterm toggle in righ-side
(package! multi-vterm)

;; window mangager
(package! edwina)

;; engine mode for quick search
(package! engine-mode)

;; better bookmark
(package! harpoon)
